{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Defines feature-to-file mappings and evidence metadata for PWA install button and client-side install logic.",
  "frontend-file-summaries.txt": "Contains short descriptions of several frontend components and a PWA install hook.",
  "frontend/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing navigation across sections and rendering AppShell with Toaster notifications.",
  "frontend/src/components/kyl/AppShell.tsx": "Layout wrapper providing header, navigation, sidebar, and footer, including the PWA install button.",
  "frontend/src/components/kyl/ContentBlock.tsx": "Card-based wrapper component for titled content sections.",
  "frontend/src/components/kyl/InstallAppButton.tsx": "Button that triggers PWA installation or shows fallback instructions when unsupported.",
  "frontend/src/components/kyl/KeyFeaturesCard.tsx": "Displays a legislative act title with a list of key features styled in a card.",
  "frontend/src/components/kyl/nav.ts": "Defines navigation section metadata used by the AppShell.",
  "frontend/src/components/kyl/ScenarioCard.tsx": "Renders a mediation scenario card with description and step‑by‑step resolution list.",
  "frontend/src/components/kyl/TopOverview.tsx": "Overview page with hero image, intro text, and navigation cards to main sections.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication with AuthClient, exposing identity state, login, clear, and status flags.",
  "frontend/src/hooks/usePwaInstall.ts": "Implements a hook to manage PWA installation prompts, standalone detection, and tracking install outcomes.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes with typography and layout styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering.",
  "frontend/src/sections/AboutMediationSection.tsx": "Renders an accordion-based section explaining mediation, its benefits, and suitable dispute types.",
  "frontend/src/sections/LegislativeKnowledgeSection.tsx": "Displays tabbed summaries of key features from mediation, civil procedure, and arbitration legal frameworks.",
  "frontend/src/sections/ScenariosSection.tsx": "Presents mediation scenarios with detailed dispute descriptions and step‑by‑step resolution outlines in an accordion layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, typography, animations, and plugins for container queries and animations.",
  "project_state.json": "Project state metadata for the KYL legal awareness app, including versioning, architecture notes, features, and requirements."
}