{
  "backend/main.mo": "Defines an empty Motoko actor with no methods.",
  "feature_evidence.json": "Describes evidence for removing the Play Store Guide UI section, listing affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files, mainly React components and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and extensive light/dark theme CSS variables.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React component controlling active section state and rendering section content within AppShell.",
  "frontend/src/components/kyl/AppShell.tsx": "Layout component providing header, navigation, sidebar, and footer around main content.",
  "frontend/src/components/kyl/ContentBlock.tsx": "Reusable card-styled content block with title and body.",
  "frontend/src/components/kyl/InstallAppButton.tsx": "PWA install button that triggers install prompt or shows fallback instructions.",
  "frontend/src/components/kyl/KeyFeaturesCard.tsx": "Card component displaying an act title and a list of key features.",
  "frontend/src/components/kyl/nav.ts": "Defines navigation section metadata including IDs, labels, and icons.",
  "frontend/src/components/kyl/ScenarioCard.tsx": "Card presenting a scenario, involved parties, and mediation resolution steps.",
  "frontend/src/components/kyl/TopOverview.tsx": "Overview page with hero image, intro text, and navigation cards linking to app sections.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing a backend actor based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider managing Internet Identity authentication, including loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/usePwaInstall.ts": "Hook detecting PWA installability and standalone mode, exposing an install prompt handler and install outcome state.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme CSS variables, typography, and base UI styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/sections/AboutMediationSection.tsx": "UI section with accordion-based educational content explaining mediation basics and benefits.",
  "frontend/src/sections/LegislativeKnowledgeSection.tsx": "Section rendering tabbed feature lists summarizing key provisions of mediation, civil procedure, and arbitration laws.",
  "frontend/src/sections/PlayStoreChecklistSection.tsx": "Empty section file with no content.",
  "frontend/src/sections/ScenariosSection.tsx": "Accordion-based section presenting detailed mediation scenarios with parties, disputes, and step‑by‑step resolutions.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system, extended theme settings, and typography/container-query/animation plugins.",
  "project_state.json": "Project state file describing KYL app metadata, architecture notes, issues, and implemented features with requirements tracking."
}